<template>
    <div class="article-detail">
        <h1>{{ article.title }}</h1>
        <p>{{ article.content }}</p>
        <div class="article-detail_btnum">
            <el-button type="primary" @click="goBack">返回上一页</el-button>
            <el-button type="primary" @click="clickBtn">点赞</el-button>
            <div class="article-detail_num">{{ num }}</div>
        </div>
    </div>
</template>


<script>
import router from '@/router';
export default {
    data() {
        return {
            article: {}, 
            num: 0,
        };
    },
    created() {
        this.getArticleById(this.$route.params.id);
    },
    methods: {
        getArticleById(id) {
            const articles = [
                { id: "1", title: "习近平向全球可持续交通高峰论坛致贺信", content: "新华社北京9月25日电 9月25日，国家主席习近平向全球可持续交通高峰论坛致贺信。习近平指出，建设安全、便捷、高效、绿色、经济、包容、韧性的可持续交通体系，是支撑服务经济社会高质量发展、实现“人享其行、物畅其流”美好愿景的重要举措。中国正在加快建设交通强国，将继续坚持与世界相交、与时代相通，致力于推动全球交通合作，以自身发展为世界提供新机遇。中国愿同世界各国一道，秉持共商共建共享理念，让可持续交通发展成果更好造福世界各国人民，为落实全球发展倡议、实现联合国2030年可持续发展目标、推动构建人类命运共同体作出积极贡献。全球可持续交通高峰论坛主题为“可持续交通：携手合作助力全球发展”，由交通运输部主办，25日在北京开幕。" },
                { id: "2", title: "李大钊：中国共产党的创始人之一", content: "北京香山万安公墓内的李大钊烈士陵园，是根据中共中央的决定修建的。在墓碑上有中共中央撰写的碑文。碑文指出：李大钊同志是中国最早的马克思主义者和共产主义者，是中国共产党的主要创始人之一。他对中国人民的解放事业，对马克思主义的信仰和无产阶级的革命前途无限忠诚。他为在我国开创和发展共产主义运动的大无畏的献身精神，永远是一切革命者的光辉典范。李大钊，字守常，河北省乐亭县人，生于1889年10月29日。1907年考入天津北洋法政专门学校学习政治经济。1913年冬，李大钊怀着忧国忧民的情怀，东渡日本，考入东京早稻田大学政治本科学习。当日本帝国主义向袁世凯提出灭亡中国的“二十一条”后，他积极参加留日学生总会的爱国斗争，他起草的《警告全国父老书》的通电迅速传遍全国，他也因此成为举国闻名的爱国志士。1916年李大钊回国后，积极参与正在兴起的新文化运动。俄国十月社会主义革命的胜利极大地鼓舞和启发了李大钊，他先后发表了《法俄革命之比较观》、《庶民的胜利》和《布尔什维主义的胜利》等文章和演说。他宣称：“试看将来的环球，必是赤旗的世界！”1919年，他又发表了《新纪元》、《我的马克思主义观》、《再论问题与主义》等几十篇宣传马克思主义的文章。1920年3月，李大钊在北京大学发起组织马克思学说研究会。10月，在李大钊发起下，北京共产主义小组建立。1921年中国共产党成立后，李大钊代表党中央指导北方的工作。在党的二大、三大和四大，他都当选为中央委员。1926年3月，李大钊领导并亲自参加了北京人民反对日、英帝国主义和反对军阀张作霖、吴佩孚的斗争。北洋军阀段祺瑞执政府制造了“三一八”惨案，北京一片白色恐怖。李大钊在极端危险和困难的情况下，继续领导党的北方组织坚持革命斗争。1927年4月6日，奉系军阀张作霖勾结帝国主义，闯进苏联大使馆驻地，逮捕了李大钊等80余人。李大钊备受酷刑，在监狱中，在法庭上，始终大义凛然，坚贞不屈。4月28日，军阀不顾广大人民群众和社会舆论的强烈反对和谴责，悍然将李大钊等20位革命者绞杀在西交民巷京师看守所内。李大钊第一个走上绞架，从容就义，时年38岁。" },
                { id: "3", title:"蔡和森：中国共产党工人运动领袖", content:"蔡和森生于1895年，是我党早期卓越的领导人和工人运动领袖，1931年8月被国民党反动派杀害，年仅36岁。1925年5月15日，上海日本棉纱厂发生了一起枪杀工人顾正红的事件，激起了群众的强烈愤慨。在革命斗争的关键时刻，蔡和森毫不犹豫地站了出来。他和刘少奇等同志，一方面深入群众之中组织领导罢工活动，另一方面广泛发动各界声援，形成大规模的群众性反帝爱国运动。5月28日，在党中央召开的紧急会议上，蔡和森建议说：“5月30日工部局要非法审讯被捕学生，企图以此恫吓上海人民，我们应该在这一天组织反帝斗争大示威，同他们进行针锋相对的斗争。”他还提出应不失时机地把上海工人、学生的反帝斗争推向全国，形成全国性的反帝运动。 在蔡和森等人的组织下，5月30日，上海人民积蓄已久的反帝斗争怒火终于爆发了，这就是震惊中外的“五卅运动”。面对中国人民的反抗，帝国主义进行了疯狂的镇压。5月30日晚，中央再次召开紧急会议。蔡和森提出，在目前的形势下，必须进一步团结群众，组成浩浩荡荡的反帝大军，实行工人罢工、学生罢课、商人罢市的“三罢”斗争。在蔡和森等人领导下，“三罢”斗争迅速波及全国，掀起了波澜壮阔的反帝斗争高潮。\n“五卅运动”在中国革命史上写下了光辉的一页。蔡和森在这场运动中，始终站在革命斗争的最前列。"}
            ];
            console.log(articles)
            const foundArticle = articles.find(article => article.id === id);
            if (foundArticle) {
                this.article = foundArticle;
            } else {
                console.log("没有找到文章");
            }
        },
        clickBtn() {
            this.num++;
            console.log(router)
        },
        goBack() {
            router.go(-1);
        }
    },
    
};
</script>

<style scoped>
.article-detail {
    margin: auto;
    padding: 20px;
    display: flex;
    flex-direction: column; 
    align-items: center; 
    text-align: center; 
    height: 100vh; 
}

.article-detail_btnum {
    display: flex;
    align-items: center;
    margin-top: 20px;
}

.article-detail_num {
    margin-left: 20px;
    font-size: 20px;
}
</style>
